package collection;
//2024.6.14 4교시

public class CollectionBasic {
    /*
    컬렉션 프레임워크 : 다수의 데이터를 관리하기 위해 자바에서 제공하는 기능 사용
    컬렉션 : 데이터 모음집
    컬렉션 프레임워크에는 기본 자료형 저장 불가

    제공되는 인터페이스(자료 구조에 따라 데이터의 저장 형태가 달라지기 때문에 4가지 방법 제공)
    List, Set, Queue, Map
    List에 저장되는 데이터의 특징 : 데이터의 순번 존재, 데이터의 중복 가능
    Set에 저장되는 데이터의 특징 : 데이터의 순번 없음, 데이터 중복 불가
    stack(L.I.F.O) 마지막에 들어간 데이터가 가장 처음 나오는 구조
    queue(F.I.F.O) 데이터가 들어간 순서대로 나옴 /이거 아예 안씀

    List 인터페이스를 구현한 클래스
     - ArrayList ; 배열보다 데이터 추가,삭제는 빠르나 읽는 것은 느림
     - LinkedList

    */

}
